In [1]:
import pandas as pd
from io import StringIO

In [7]:
data = """[{"user_id":1,"artist_id":101,"listen_count":50},
           {"user_id":1,"artist_id":102,"listen_count":30},
           {"user_id":2,"artist_id":103,"listen_count":70},
           {"user_id":2,"artist_id":104,"listen_count":45}]"""


df=pd.read_json(StringIO(data))

In [8]:
df

   user_id  artist_id  listen_count
0        1        101            50
1        1        102            30
2        2        103            70
3        2        104            45

In [9]:
df.to_json()

'{"user_id":{"0":1,"1":1,"2":2,"3":2},"artist_id":{"0":101,"1":102,"2":103,"3":104},"listen_count":{"0":50,"1":30,"2":70,"3":45}}'

In [10]:
df.to_json(orient="index")

'{"0":{"user_id":1,"artist_id":101,"listen_count":50},"1":{"user_id":1,"artist_id":102,"listen_count":30},"2":{"user_id":2,"artist_id":103,"listen_count":70},"3":{"user_id":2,"artist_id":104,"listen_count":45}}'

In [11]:
df.to_json(orient="records")

'[{"user_id":1,"artist_id":101,"listen_count":50},{"user_id":1,"artist_id":102,"listen_count":30},{"user_id":2,"artist_id":103,"listen_count":70},{"user_id":2,"artist_id":104,"listen_count":45}]'

In [13]:
%pip install lxml

Note: you may need to restart the kernel to use updated packages.Collecting lxml
  Downloading lxml-5.3.1-cp312-cp312-win_amd64.whl.metadata (3.8 kB)
Downloading lxml-5.3.1-cp312-cp312-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ----- ---------------------------------- 0.5/3.8 MB 1.5 MB/s eta 0:00:03
   -------- ------------------------------- 0.8/3.8 MB 1.5 MB/s eta 0:00:02
   ---------- ----------------------------- 1.0/3.8 MB 1.5 MB/s eta 0:00:02
   ------------- -------------------------- 1.3/3.8 MB 1.5 MB/s eta 0:00:02
   ---------------- ----------------------- 1.6/3.8 MB 1.3 MB/s eta 0:00:02
   ---------------- ----------------------- 1.6/3.8 MB 1.3 MB/s eta 0:00:02
   ------------------- -------------------- 1.8/3.8 MB 1.2 MB/s eta 0:00:02
   --------------------- ------------------ 2.1/3.8 MB 1.2 MB/s eta 0:00:02
   ------------------------ --------------- 2.4/3.8 MB 1.1 MB/s eta 0:00:02
   --------------------------- ------------ 2.6/3.8 MB 1.1 MB/s eta 0:00:02
   ------------------------------ --------- 2.9/3.8 MB 1.1 MB/s eta 0:00:01
   -------------------------------- ------- 3.1/3.8 MB 1.1 MB/s eta 0:00:01
   -------------------------------- ------- 3.1/3.8 MB 1.1 MB/s eta 0:00:01
   ----------------------------------- ---- 3.4/3.8 MB 1.1 MB/s eta 0:00:01
   -------------------------------------- - 3.7/3.8 MB 1.1 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 1.1 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.3.1

In [15]:
data = "https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2"
df = pd.read_html(data)

In [24]:
df[0]

,Short name,Long name,Comment
0,ISO 3166-2,Country subdivision code[1],NaN
1,ISO 3901,International Standard Recording Code (ISRC)[2],NaN
2,ISO 4217,Currency code[3],NaN
3,ISO 6166,International Securities Identifying Number (I...,NaN
4,ISO 9362,Bank Identifier Codes (BIC),Also known as SWIFT codes[5]
5,ISO 13616,International Bank Account Number (IBAN)[6],NaN
6,ISO 15511,International Standard Identifier for Librarie...,NaN
7,UN/LOCODE,United Nations Code for Trade and Transport Lo...,Implemented by the United Nations Economic Com...

In [38]:
df_execl = pd.read_excel("data.xlsx")

In [39]:
df_execl.to_pickle("d_excel")

In [40]:
pd.read_pickle("d_excel")

    Name  Age
0  Samin   25
1  Masud   26
2   Jack   32
3   John   45